[
    {
        "id": 1,
        "title": "Performance Framework Development",
        "content": "Created a python script. Created Hybrid framework with both modular and data driven model from scratch. Developed page related functions with proper mappings of different controller, samplers, Post and pre processing scripts. Made the framework to support 300+ number of users stress at a time(Product needs to support only max of 300 users stress). Made the frame work capable of performing load test, stress test and soak test.",
        "role": "Developer",
        "technology": "Jmeter"
    },
    {
        "id": 2,
        "title": "Runner script for Performance",
        "content": "Created a python script which is capable of running the script at a time with different loads of users. It is capable of supervising the jmeter  framework run and record errors in run and intelligently re-runs with same set of users if needed until it reaches the max threshold total runs. It also documents the data and group it according to the total users ran and product that got tested. This script drastically reduced manual work.",
        "role": "Developer",
        "technology": "Python, Jmeter"
    },
    {
        "id": 3,
        "title": "Automation Master Run - Window service",
        "content": "Created a windows service from scratch that is capable of running automation run daily without any manual interventions. Installed the service to the RDP windows machine, made the service to be controlled from another remote DB like at what time it can run and where to store the data or we can start and stop the run as need. It also intelligently groups as well separate the list of test cases that are passed as well as failed in first run and rerun the failed case till the threshold times. This script drastically reduced manual work by listing out passed, failed and exempted cases for each runs and shooting out single mail to the entire QA team.",
        "role": "Developer",
        "technology": "C#, SQL Server"
    },
    {
        "id": 4,
        "title": "Chrome Memory Usage tracker",
        "content": "Created a window application that can read the memory usage of any chrome tab under test eg: Facebook, youtube or any product. This tool will keep on tracking the total amount of memory that particular tab is consuming. Integrated this application with window toaster notification functionality and capable of working in background from window notification area. Provided with on hover option on icon to see the current memory consumption and start, stop and exit option in both the context menu as well as in window area. We can provide the total amount of threshold from our side, it will alert the user with popup as well as toast notification when that tab exceeds the threshold memory",
        "role": "Product Owner and Developer",
        "technology": "C#"
    },
    {
        "id": 5,
        "title": "IC-EHR-Navigations",
        "content": "Created a product that helps in finding as well as documenting the existing navigations in our product page. This initiative is to reduce the meeting time to know about page navigations for Dev, QA and PO, By which they can spend their quality time for improving productivity.",
        "role": "Developer and Tester",
        "technology": "C#, Entity Framework, SQL Server, ASP.net MVC framework"
    },
    {
        "id": 6,
        "title": "Chrome response redirector for performance script development",
        "content": "Since chrome browser wont store response data for a long time, I created this one. This is a chrome extension that actually redirects the chrome response, form data, request headers of post method related pages to the console log and keeps it stored there. Created minor python scripts that actually operates and modify the data in clipboard, so jmeter can directly accept the paste operation in post parameter or headers related to the selected samplers.",
        "role": "Product Owner and Developer",
        "technology": "C#, JavaScript"
    },
    {
        "id": 7,
        "title": "Automation Works",
        "content": "Automated the hotfix related test cases, stable areas related test cases etc. Took more tasks and completed them before deadlines. Guided the team to follow the best coding and provided lot of code check guidelines for the team. Created lot of simple tools that simplifies and reduces the manual effort of the entire team and improved their quality time.",
        "role": "Automation Developer",
        "technology": "C#, JavaScript, Selenium"
    },
    {
        "id": 8,
        "title": "Scheduling process Improvement",
        "content": "Appointment scheduler with lot of functions that improve user experience. Handled more than 90% of the entire product testing and raised more than 200+ bugs single handedly. In very short time, created metrics and updated the leadership. Got the whole QA Team attention and appreciation for handling more than 30+ tasks in a period of 10days when team member got relieved due to health reasons. Got appreciated from Director, Manager and product owners for keeping the testing and product stable even when there is a lot of changes in the team",
        "role": "Manual Tester",
        "technology": "C#, JavaScript"
    },
    {
        "id": 9,
        "title": "Integrating EHR with Secured Medical database",
        "content": "A part of Electronic health record Team work, to integrate big knowledge source for product improvement. Tested for the various workflows that alerts the medical practitioners about people health conditions. Checked for the levels of interaction alert and raised as well as suggested the areas where even product owners missed. Got appreciated from Director Technology for handling the product testing smoothly with less resources",
        "role": "Manual Tester",
        "technology": "C#, JavaScript"
    },
    {
        "id": 10,
        "title": "Electronic Health Record – Oncology",
        "content": "Tested the workflows related to the cancer treatment including the medication course allocation and discontinuing them as needed.Tested each and every area for precise information.Found and reported lot of critical issues including patient safety issues, Time zone issues etc.Got appreciation from product owner, managers and developers for deep level testing and high level of understanding product in short time duration.",
        "role": "Manual Tester",
        "technology": "C#, JavaScript"
    },
    {
        "id": 11,
        "title": "Applicant Tracking System",
        "content": "This project is focused on the Applicants tracking system in any organization from Candidate applying to the job or candidate getting referred for the job stage to the completion of onboarding process. Tested each and every area from resume parsing to work checklists for every hiring manager, recruiters and Human resource and their related functionalities.",
        "role": "Manual Tester",
        "technology": "Ruby on rails, Ember js"
    },
    {
        "id": 12,
        "title": "Job Boards Integration",
        "content": "This project is mainly focused on publishing the jobs to different available job boards including the job sponsoring, cancelling or pausing the job boards publications as and when needed. Tested areas related to republishing the job when needed and improving or closing the sponsorship for the job.",
        "role": "Manual Tester, white box tester, Automation developer",
        "technology": "Ruby on rails, Ember js, Ruby, Rspec, Selenium"
    },
    {
        "id": 13,
        "title": "Project Redemption",
        "content": "Shown Proof of Concept on improving the automation runs stability, Provided a lot of sessions  to improve the automation stability improvement and proper structuring of the test cases for easy scalability and trouble shooting in the future. Raised the pass percentage from 35 % to 90 % for the entire modules in 9 months",
        "role": "Automation Developer",
        "technology": "Selenium, Rspec, Ruby"
    },
    {
        "id": 14,
        "title": "Pull request title validation",
        "content": "Created a simple check using github actions to ensure that the pull request titles are matching the standard names as expected, if not this will raise a github pull request check failure flag to notify the code reviewer.",
        "role": "Developer",
        "technology": "Javascript, Github actions" 
    },
    {
        "id": 15,
        "title": "Unit Test run improvement",
        "content": "Developed mechanisms to parallelize the unit test run using docker containers in Jenkins pipeline, this improved the time taken to complete the entire product unit test run from 1 hour 10 mins to 40 mins max.",
        "role":"Developer and Tester",
        "technology": "AWS S3 bucket, Jenkins, Github, Shell script"
    },
    {
        "id": 16,
        "title": "Automated Coverage report organizer and analyzer",
        "content": "Provided the logic to group the rspec coverage report as per Team names and improved ownership across Teams, Also created the mechanism to raise and assign bugs to respective developers by extracting output of rspec run for every Pull requests, for this to maintain the security, performance and stability, engineered AWS S3 bucket, Jenkins pipeline job and simple ruby script together efficiently",
        "role": "Developer and Tester",
        "technology": "AWS S3 bucket, Jenkins, Github, Ruby, Shell script" 
    },
    {
        "id": 17,
        "title": "Deployment Process improvement",
        "content": "Integrated the product deployment process to the internal tool that prevent the direct code execution in any environment without proper approvals. This reduced the risk of accidental database updates or unacceptable data usages",
        "role": "Developer",
        "technology": "Ruby on rails, Github"
    },
    {
        "id": 18,
        "title": "Auditing works",
        "content": "Complete auditing of the entire Freshteam product from its core architecture to the entire product for a compliance work, Gone through lot of leadership meetings and collected configuration details, restricted permissions for deployments using AWS IAM, collected configurations for the Disaster recovery system and so on.",
        "role": "Site Reliability engineer, Tester",
        "technology": "AWS and few other internal tools"
    }
]
